Revit 2024 API
CompoundStructure.FindEnclosingRegionAndSegments Method
 Given a pair of grid coordinates, and a direction for splitting, returns the enclosing region and the two segments intersected by a line through the grid point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public int FindEnclosingRegionAndSegments(
	UV gridUV,
	RectangularGridSegmentOrientation splitDirection,
	out int segmentId1,
	out int segmentId2
)
Visual Basic
Public Function FindEnclosingRegionAndSegments ( _
	gridUV As UV, _
	splitDirection As RectangularGridSegmentOrientation, _
	<OutAttribute> ByRef segmentId1 As Integer, _
	<OutAttribute> ByRef segmentId2 As Integer _
) As Integer
Visual C++
public:
int FindEnclosingRegionAndSegments(
	UV^ gridUV,
	RectangularGridSegmentOrientation splitDirection,
	[OutAttribute] int% segmentId1,
	[OutAttribute] int% segmentId2
)
Parameters
gridUV
Type: Autodesk.Revit.DB.UV
 Coordinates of a point in the rectangular grid of this compound structure.
splitDirection
Type: Autodesk.Revit.DB.RectangularGridSegmentOrientation
 Specifies the direction of the split.
segmentId1
Type: System.Int32
 The id of a segment in the boundary of the containing region which is split by a line through gridUV in the specified direction.
segmentId2
Type: System.Int32
 The id of a segment in the boundary of the containing region which is split by a line through gridUV in the specified direction.
Return Value
 Returns the id of the enclosing region, and -1 if no region encloses the point.
Remarks
 Grid coordinates correspond to uv coordinates of faces.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  This operation is valid only for vertically compound structures.
See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace